# Python Pandas

Pandas stands for panel data and is the core library for data manipulation and data analysis
It consists of single and multiple dimensional data structures for data manipulation

### Python data structures
Single dimensional, Multi dimensional

### Pandas Series Object
Series object is one dimensional labeled array

In [5]:
import pandas as pd
s1 = pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
type(s1)

pandas.core.series.Series

In [7]:
import pandas as pd
s1 = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [9]:
# Series Object from Dictionary

import pandas as pd
pd.Series({'a':10,'b':20,'c':30})

a    10
b    20
c    30
dtype: int64

In [10]:
import pandas as pd
pd.Series({'a':10,'b':20,'c':30},index=['b','c','d','a'])

b    20.0
c    30.0
d     NaN
a    10.0
dtype: float64

In [13]:
# Extracting individual values

import pandas as pd
s1 = pd.Series([1,2,3,4,5,6,7,8,9])
s1[8]

9

In [14]:
s1[:8]

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [15]:
s1[-8:]

1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

## Basic Math operations on Series

In [17]:
s1+5

0     6
1     7
2     8
3     9
4    10
5    11
6    12
7    13
8    14
dtype: int64

In [18]:
s1 = pd.Series([1,2,3,4,5,6,7,8,9])
s2 = pd.Series([10,20,30,40,50,60,70,80,90])
s1+s2

0    11
1    22
2    33
3    44
4    55
5    66
6    77
7    88
8    99
dtype: int64

In [19]:
# Pandas dataframe

#  Dataframe is a two dimensional labelled data structure
# A dataframe comprises of rows and column

In [20]:
# Creating a dataframe

import pandas as pd
pd.DataFrame({"Name":["Md","Ahoj","AKD","Jack","Dan"],"Marks":[87,88,91,86,85]})

   Name  Marks
0    Md     87
1  Ahoj     88
2   AKD     91
3  Jack     86
4   Dan     85

## Dataframe in-Built function

In [14]:
import pandas as pd
iris = pd.read_csv("Documents\iris.csv")

In [15]:
iris.head()

         Date      Client Sales in Million
0  01-04-2020  Kotak Bank            38 M
1  02-04-2020        HSBC            30 M
2  03-04-2020         SBI            81 M
3  04-04-2020        HDFC            30 M
4  05-04-2020       ICICI            88 M

In [16]:
iris.tail()

         Date         Client Sales in Million
5  06-04-2020  Bank of India            18 M
6  07-04-2020    Punjab Bank            24 M
7  08-04-2020  Mahindra Bank            57 M
8  09-04-2020       YES Bank            27 M
9  10-04-2020          PAYTM            14 M

In [19]:
iris.shape

(10, 3)

In [20]:
iris.describe()

              Date      Client Sales in Million
count           10          10               10
unique          10          10                9
top     01-04-2020  Kotak Bank            30 M
freq             1           1                2

In [25]:
iris.iloc[4:8,1:3]

          Client Sales in Million
4          ICICI            88 M
5  Bank of India            18 M
6    Punjab Bank            24 M
7  Mahindra Bank            57 M

In [26]:
iris.loc[2:7,("Date","Client")]

         Date         Client
2  03-04-2020            SBI
3  04-04-2020           HDFC
4  05-04-2020          ICICI
5  06-04-2020  Bank of India
6  07-04-2020    Punjab Bank
7  08-04-2020  Mahindra Bank

In [27]:
iris.drop("Client",axis=1)

         Date Sales in Million
0  01-04-2020            38 M
1  02-04-2020            30 M
2  03-04-2020            81 M
3  04-04-2020            30 M
4  05-04-2020            88 M
5  06-04-2020            18 M
6  07-04-2020            24 M
7  08-04-2020            57 M
8  09-04-2020            27 M
9  10-04-2020            14 M

In [3]:
import pandas as pd
iris = pd.read_csv("Documents\iris.csv")
iris.drop([1,2,4],axis=0)

         Date         Client Sales in Million
0  01-04-2020     Kotak Bank            38 M
3  04-04-2020           HDFC            30 M
5  06-04-2020  Bank of India            18 M
6  07-04-2020    Punjab Bank            24 M
7  08-04-2020  Mahindra Bank            57 M
8  09-04-2020       YES Bank            27 M
9  10-04-2020          PAYTM            14 M

In [6]:
import pandas as pd
iris = pd.read_csv("Documents\iris.csv")
iris.mean()

Sales      50.142857
Profit     61.857143
Price     542.642857
dtype: float64

In [8]:
iris.median()

Sales      47.0
Profit     63.5
Price     585.5
dtype: float64

In [9]:
iris.max()

Sales      85
Profit     97
Price     925
dtype: int64

In [10]:
iris.min()

Sales      15
Profit     15
Price     116
dtype: int64

In [17]:
def half(s):
    return s*0.5

iris[['Sales','Price']].apply(half)

    Sales  Price
0     7.5   60.5
1    20.5  298.5
2    42.5  249.0
3    37.0  462.5
4    27.5  157.5
5    32.0  421.0
6    13.0   58.0
7    14.0  408.5
8    15.0  287.0
9    37.0  449.0
10   36.5  445.0
11   21.5  338.0
12   21.5   94.0
13   25.5   70.0

In [19]:
import pandas as pd
iris = pd.read_csv("Documents\iris.csv")
iris['Month'].value_counts()

January      2
February     2
March        1
April        1
May          1
June         1
July         1
August       1
September    1
October      1
November     1
December     1
Name: Month, dtype: int64

In [20]:
iris.sort_values(by='Month')

    Sales  Profit  Price      Month
3      74      76    925      April
7      28      35    817     August
11     43      50    676   December
1      41      33    597   February
13     51      97    140   February
0      15      72    121    January
12     43      89    188    January
6      26      58    116       July
5      64      34    842       June
2      85      68    498      March
4      55      59    315        May
10     73      94    890   November
9      74      15    898    October
8      30      86    574  September

# Analyzed by


ùêåùêù ùêëùêöùê¢ùêûùê¨ùê°,
Enrollment number : ùüèùüóùêîùêåùêÑùüèùüèùüî,
Registration number : ùüèùüóùüèùüèùüëùüíùüì,
B Tech,7ùê≠ùê° semester,Section : ùêÄ,
Mechanical Engineering Department,
National Institute of Technology Agartala, Tripura 799046,